; domain
(define (domain newblocks)
  (:requirements :strips :typing)
  (:types block 
          ;added
          colour
  )
  (:predicates (on ?x - block ?y - block)
	       (ontable ?x - block)
	       (clear ?x - block)
	       (handempty)
	       (holding ?x - block)
	       
	       ;;added 
           (colour-of ?b - block ?c - colour)
	       (last-colour ?c - colour)
	       (handclean)
	       
    (done_action_unstack-same-colour ?x - block ?y - block ?c - colour)
	       )


   (:action clean
  :parameters(?c - colour)
  :precondition(and (handempty) (last-colour ?c))
  :effect(and 
  	(handclean) 
  	(not (last-colour ?c)))
   )	
	             
  (:action pick-up
	     :parameters (?x - block
                          ;added      
                          ?c - colour
	     )
	     :precondition (and (clear ?x) (ontable ?x) (handempty) 
                                ;;added
                                (colour-of ?x ?c)
                                (handclean)
	     )
	     :effect
	     (and (not (ontable ?x))
		   (not (clear ?x))
		   (not (handempty))
		   (holding ?x)
                   ;;added
                   (not (handclean))
                   (last-colour ?c)
            )
  )
  
  (:action pick-up-same-colour
	     :parameters (?x - block
                          ;added      
                          ?c - colour
	     )
	     :precondition (and (clear ?x) (ontable ?x) (handempty) 
                                ;;added
                                (colour-of ?x ?c)
                                (last-colour ?c)
	     )
	     :effect
	     (and (not (ontable ?x))
		   (not (clear ?x))
		   (not (handempty))
		   (holding ?x)
                   ;;added
                   (not (handclean))
                   (last-colour ?c)
            )
  )

  (:action put-down
	     :parameters (?x - block)
	     :precondition (holding ?x)
	     :effect
	     (and (not (holding ?x))
		   (clear ?x)
		   (handempty)
		   (ontable ?x)))
  (:action stack
	     :parameters (?x - block ?y - block)
	     :precondition (and (holding ?x) (clear ?y))
	     :effect
	     (and (not (holding ?x))
		   (not (clear ?y))
		   (clear ?x)
		   (handempty)
		   (on ?x ?y)))
  (:action unstack
	     :parameters (?x - block ?y - block ?c - colour)
	     :precondition (and (on ?x ?y) (clear ?x) (handempty)
                                ;;added
                                (colour-of ?x ?c)
                                (handclean)
	     
	     )
	     :effect
	     (and (holding ?x)
		   (clear ?y)
		   (not (clear ?x))
		   (not (handempty))
		   (not (on ?x ?y))
                   ;;added
                   (not (handclean))
                   (last-colour ?c)
            )
    )
    
    (:action unstack-same-colour
	     :parameters (?x - block ?y - block ?c - colour)
	     :precondition (and (on ?x ?y) (clear ?x) (handempty)
                                ;;added
                                (colour-of ?x ?c)
                                (last-colour ?c)    
	     
	     )
	     :effect
	     (and (holding ?x)
  (done_action_unstack-same-colour ?x ?y ?c)
		   (clear ?y)
		   (not (clear ?x))
		   (not (handempty))
		   (not (on ?x ?y))
                   ;;added
                   (not (handclean))
                   (last-colour ?c)
            )
		   
    ))

; problem
(define (problem sussman_progressed_progressed)
(:domain newblocks)
(:objects
a - block
b - block
c - block
d - block
red - colour
yellow - colour
)

(:init
(clear b)
(ontable c)
(colour-of b red)
(colour-of a yellow)
(colour-of c red)
(ontable d)
(clear d)
(colour-of d yellow)
(last-colour yellow)
(holding a)
(done_action_unstack-same-colour a b yellow)
(clear c)
(ontable b)
)


(:goal (and
    
    (on c d)
    (on b c)
    (on a b)
    ))
)

; plan
1. (stack a b)
   deleted: (holding a) (clear b)
   added: (clear a) (handempty) (on a b)
   goals met: 1 of 3
2. (clean yellow)
   deleted: (last-colour yellow)
   added: (handclean)
   goals met: 1 of 3
3. (pick-up c red)
   deleted: (ontable c) (clear c) (handempty) (handclean)
   added: (holding c) (last-colour red)
   goals met: 1 of 3
4. (stack c d)
   deleted: (holding c) (clear d)
   added: (clear c) (handempty) (on c d)
   goals met: 2 of 3
5. (clean red)
   deleted: (last-colour red)
   added: (handclean)
   goals met: 2 of 3
6. (unstack a b yellow)
   deleted: (clear a) (handempty) (on a b) (handclean)
   added: (holding a) (clear b) (last-colour yellow)
   goals met: 1 of 3
7. (put-down a)
   deleted: (holding a)
   added: (clear a) (handempty) (ontable a)
   goals met: 1 of 3
8. (clean yellow)
   deleted: (last-colour yellow)
   added: (handclean)
   goals met: 1 of 3
9. (pick-up b red)
   deleted: (ontable b) (clear b) (handempty) (handclean)
   added: (holding b) (last-colour red)
   goals met: 1 of 3
10. (stack b c)
   deleted: (holding b) (clear c)
   added: (clear b) (handempty) (on b c)
   goals met: 2 of 3
11. (clean red)
   deleted: (last-colour red)
   added: (handclean)
   goals met: 2 of 3
12. (pick-up a yellow)
   deleted: (ontable a) (clear a) (handempty) (handclean)
   added: (holding a) (last-colour yellow)
   goals met: 2 of 3
13. (stack a b)
   deleted: (holding a) (clear b)
   added: (clear a) (handempty) (on a b)
   goals met: 3 of 3
